# Написать функцию thesaurus(), принимающую в качестве аргументов имена сотрудников и возвращающую словарь,
# в котором ключи — первые буквы имён, а значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# Например:
# >>> thesaurus("Иван", "Мария", "Петр", "Илья")
# {
#     "И": ["Иван", "Илья"],
#     "М": ["Мария"], "П": ["Петр"]
# }
#
#
# Подумайте: полезен ли будет вам оператор распаковки?
# Как поступить, если потребуется сортировка по ключам? Можно ли использовать словарь в этом случае?


def thesaurus(*names):
    name_d = dict()
    for i in sorted(names):
        key = i[0]
        if name_d.get(key) is None:
            name_d[key] = [i]
        else:
            name_d[key].append(i)
    return name_d


print(thesaurus('Илья', 'Мария', 'Лена', 'Руслан', 'Владимир', 'Ринат'))
