# Реализовать функцию get_jokes(), возвращающую n шуток, сформированных из трех случайных слов, взятых из трёх списков (по одному из каждого):
# nouns = ["автомобиль", "лес", "огонь", "город", "дом"]
# adverbs = ["сегодня", "вчера", "завтра", "позавчера", "ночью"]
# adjectives = ["веселый", "яркий", "зеленый", "утопичный", "мягкий"]
# Например:
# >>> get_jokes(2)
# ["лес завтра зеленый", "город вчера веселый"]
# Документировать код функции.
# Сможете ли вы добавить еще один аргумент — флаг,
# разрешающий или запрещающий повторы слов в шутках (когда каждое слово можно использовать только в одной шутке)?
# Сможете ли вы сделать аргументы именованными?

import random


def get_jokes(count_j):
    nouns = ['автомобиль', 'лес', 'огонь', 'город', 'дом', 'конь']
    adverbs = ['сегодня', 'вчера', 'завтра', 'позавчера', 'ночью', 'послезавтра']
    adjectives = ['веселый', 'яркий', 'зеленый', 'утопичный', 'мягкий', 'кислый']

    joke = []
    for i in range(count_j):
        joke.append(f'{nouns[random.randint(0, 5)]} {adverbs[random.randint(0, 5)]} {adjectives[random.randint(0, 5)]}')
    return joke


number_j = int(input('Введите число шуток: '))
print(f'Шутки для вас:\n{get_jokes(number_j)}')
